#Область ПеременныеМодуля

// НА ПЕРИОД ПЕРЕХОДА

Перем глОбщиеЗначения Экспорт; // Переменная, хранящая кеш общих значений.

// КОНЕЦ НА ПЕРИОД ПЕРЕХОДА

// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт; // Общая переменная

// Конец СтандартныеПодсистемы

// МаркетинговыеАкции
Перем ПорядковыйНомерПродажи Экспорт; // Используется для вычисления скидок по кратности номера продаж.
// Конец МаркетинговыеАкции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция возвращает значение экспортных переменных модуля.
//
// Параметры:
//  Имя - строка, содержит имя переменной целиком.
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт

	Возврат ОбщегоНазначенияРТКлиент.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения.
//
// Параметры:
//  Имя - строка, содержит имя переменной целиком.
// 	Значение - значение переменной.
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначенияРТВызовСервера.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры

// Процедура открывает меню РМК.
//
Процедура ОткрытьМенюРМКУправляемыйРежимПриЗапуске() Экспорт
	
	ОткрыватьРМКПриЗапускеПрограммы = ОбщегоНазначенияРТВызовСервера.ОткрыватьРМКПриЗапускеПрограммы();
	
	Если ОткрыватьРМКПриЗапускеПрограммы  Тогда
		
		ОбщегоНазначенияРТКлиент.ОткрытьМенюРМКУправляемыйРежим()
		
	КонецЕсли;
	
	ОценкаПроизводительностиПереопределяемыйВызовСервера.ЗафиксироватьЗамерВремени(
		ПараметрыПриложения["СтандартныеПодсистемы.ОценкаПроизводительности.ТекущаяГлобальнаяОперация"],
		ПараметрыПриложения["СтандартныеПодсистемы.ОценкаПроизводительности.ТекущееВремяНачалаГлобальнойОперации"]);
	
	ПараметрыПриложения["СтандартныеПодсистемы.ОценкаПроизводительности.ТекущаяГлобальнаяОперация"] = Неопределено;
	ПараметрыПриложения["СтандартныеПодсистемы.ОценкаПроизводительности.ТекущееВремяНачалаГлобальнойОперации"] = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ) 
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	ИмяПараметра = "СтандартныеПодсистемы.ОценкаПроизводительности.ТекущаяГлобальнаяОперация";
	ПараметрыПриложения.Вставить(ИмяПараметра, ПредопределенноеЗначение("Справочник.КлючевыеОперации.ЗапускПрограммы"));
	
	ИмяПараметра = "СтандартныеПодсистемы.ОценкаПроизводительности.ТекущееВремяНачалаГлобальнойОперации";
	ПараметрыПриложения.Вставить(ИмяПараметра, ТекущаяУниверсальнаяДатаВМиллисекундах() / 1000);
	
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// МаркетинговыеАкции
	ПорядковыйНомерПродажи = 1;
	// Конец МаркетинговыеАкции
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ);
	// Конец СтандартныеПодсистемы
	
	Если НЕ Отказ Тогда
		// ПодключаемоеОборудование
		МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
		// Конец ПодключаемоеОборудование		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
